qcc-org/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "phone", "email", "address", "city", "state", "zip_code", "texts", "calls", "internship", "higher_ed", "climate_change", "democracy", "poverty", "mass_transit", "consumer", "created_at", "updated_at") VALUES ('Jon', 'smith', '', '', '', '', '', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, '2025-04-29 21:53:46.816788', '2025-04-29 21:53:46.816788') RETURNING "id"